IDENTIFICATION DIVISION.
PROGRAM-ID. BUBBLESORT.

DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 WS-ARRAY.
    05 WS-NUM PIC 9(3) OCCURS 5 TIMES.
   01 I        PIC 9.
   01 J        PIC 9.
   01 WS-TEMP  PIC 9(3).

PROCEDURE DIVISION.
 DISPLAY "ENTER 5 NUMBERS"
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
   ACCEPT WS-NUM(I)
 END-PERFORM

 PERFORM VARYING I FROM 1 BY 1 UNTIL I > 4
   PERFORM VARYING J FROM 1 BY 1 UNTIL J > 5 - I
    IF WS-NUM(J) > WS-NUM(J + 1)
     MOVE WS-NUM(J) TO WS-TEMP
     MOVE WS-NUM(J + 1) TO WS-NUM(J)
     MOVE WS-TEMP TO WS-NUM(J + 1)
    END-IF
   END-PERFORM
 END-PERFORM
 DISPLAY "SORTED ARRAY : "
 PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
   DISPLAY WS-NUM(I)
 END-PERFORM
STOP RUN.
