IDENTIFICATION DIVISION.
PROGRAM-ID. CELSIUS-FAHRENHIET.

DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-CELSIUS PIC 9(2)V9(1).
  01 WS-FAHRENHIET PIC 9(3)V9(1).

PROCEDURE DIVISION.
 DISPLAY "ENTER THE CELSIUS:".
 ACCEPT WS-CELSIUS.
 COMPUTE WS-FAHRENHIET =(WS-CELSIUS * 9 / 5) + 32.
 DISPLAY WS-FAHRENHIET.
 STOP RUN.
