IDENTIFICATION DIVISION.
  PROGRAM-ID. COMPOUND-INT.

DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-PRINCIPAL PIC 9(7)V99.
 01 WS-RATE      PIC 9(3)V99.
 01 WS-TIME      PIC 9(2).
 01 WS-AMOUNT    PIC 9(6)V99.
 01 WS-CI        PIC 9(6)V99.
 01 WS-I         PIC 9(3).

PROCEDURE DIVISION.
 ACCEPT WS-PRINCIPAL
 DISPLAY "ENTER PRINCIPAL AMOUNT : "WS-PRINCIPAL
 ACCEPT WS-RATE
 DISPLAY "ENTER RATE OF INTEREST : " WS-RATE
 ACCEPT WS-TIME
 DISPLAY "ENTER TIME: "WS-TIME
 
 MOVE WS-PRINCIPAL TO WS-AMOUNT
 PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > WS-TIME
   COMPUTE WS-AMOUNT = WS-AMOUNT + (WS-AMOUNT * WS-RATE / 100)
 END-PERFORM
   COMPUTE WS-CI = WS-AMOUNT - WS-PRINCIPAL
  DISPLAY "COMPOUND INTEREST IS : " WS-CI
  DISPLAY "TOTAL AMOUNT IS : " WS-AMOUNT
STOP RUN.
