IDENTIFICATION DIVISION.
 PROGRAM-ID. CONCATLENGTH.

DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-STR1 PIC X(20).
  01 WS-STR2 PIC X(20).
  01 WS-RESULT PIC X(30).
  01 WS-LENGTH PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
 ACCEPT WS-STR1
  DISPLAY "ENTER FIRST STRING : " WS-STR1
  ACCEPT WS-STR2
  DISPLAY "ENTER SECOND STRING : "WS-STR2
STRING WS-STR1 WS-STR2 INTO WS-RESULT
END-STRING
INSPECT WS-RESULT TALLYING WS-LENGTH FOR CHARACTERS
 DISPLAY "CONCATENATED STRING : " WS-RESULT
 DISPLAY "LENGTH OF STRING : " WS-LENGTH
STOP RUN.
