IDENTIFICATION DIVISION.
PROGRAM-ID. DIVISIBLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
 01 WS-NUM PIC 9(3).
 01 WS-QUO PIC 9(4).
 01 WS-REM2 PIC 9(3).
 01 WS-REM3 PIC 9(3).
 01 WS-REM17 PIC 9(3).

PROCEDURE DIVISION.
 DISPLAY "NUMBERS FROM 1 TO 1000 DIVISIBLE BY 2, 3 AND 17"
   PERFORM VARYING WS-NUM FROM 1 BY 1 UNTIL WS-NUM > 1000
  DIVIDE WS-NUM BY 2 GIVING WS-QUO REMAINDER WS-REM2
  DIVIDE WS-NUM BY 3 GIVING WS-QUO REMAINDER WS-REM3
  DIVIDE WS-NUM BY 17 GIVING WS-QUO REMAINDER WS-REM17
   IF WS-REM2 = 0 AND WS-REM3 = 0 AND WS-REM17 = 0
    DISPLAY WS-NUM
   END-IF
  END-PERFORM
STOP RUN.
