IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.

DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-FACT PIC 9(5) VALUE 1.
  01 WS-I PIC 9(2).
  01 WS-NUM PIC 9(2).

 PROCEDURE DIVISION.
  DISPLAY "ENTER THE NUMBER:".
  ACCEPT WS-NUM.
  PERFORM VARYING WS-I FROM WS-NUM BY -1 UNTIL WS-I=0
  COMPUTE WS-FACT=WS-FACT*WS-I
  END-PERFORM.
  DISPLAY WS-FACT.

  STOP RUN.