IDENTIFICATION DIVISION.
  PROGRAM-ID. FIBNOCCI-SUM.

DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 WS-A     PIC 9(3) VALUE 0.
 01 WS-B     PIC 9(3) VALUE 1.
 01 WS-C     PIC 9(3).
 01 WS-SUM   PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
 DISPLAY "FIBONACCI SERIES UPTO 100"
  DISPLAY WS-A
  DISPLAY WS-B
    ADD WS-A WS-B TO WS-SUM
 PERFORM UNTIL WS-C > 100
    COMPUTE WS-C = WS-A + WS-B
 IF WS-C <= 100
   DISPLAY WS-C
   ADD WS-C TO WS-SUM
  END-IF
   MOVE WS-B TO WS-A
   MOVE WS-C TO WS-B
 END-PERFORM
 DISPLAY "SUM OF FIBONACCI NUMBERS : " WS-SUM
STOP RUN.
