IDENTIFICATION DIVISION.
PROGRAM-ID. GRADE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MARK PIC 9(3).
01 WS-GRADE PIC X.

PROCEDURE DIVISION.
  DISPLAY "ENTER THE MARK:".
  ACCEPT WS-MARK.
  IF WS-MARK > 90
   MOVE "A" TO WS-GRADE
  ELSE
   IF WS-MARK >= 75
    MOVE 'B' TO WS-GRADE
   ELSE
    IF WS-MARK >= 60
     MOVE 'C' TO WS-GRADE
    ELSE
     IF WS-MARK >= 50
      MOVE 'D' TO WS-GRADE
     ELSE
       MOVE 'F' TO WS-GRADE
     END-IF
    END-IF
   END-IF
  END-IF
 DISPLAY "GRADE : " WS-GRADE
STOP RUN.
