IDENTIFICATION DIVISION.
PROGRAM-ID. LARGEST-NUMBER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 9(2).
01 WS-B PIC 9(2).
01 WS-C PIC 9(2).

PROCEDURE DIVISION.
 DISPLAY "ENTER THREE NUMBERS : "
 ACCEPT WS-A
 ACCEPT WS-B
 ACCEPT WS-C
 IF WS-A > WS-B AND WS-A > WS-C
  DISPLAY "LARGEST NUMBER IS : " WS-A
  ELSE
  IF WS-B > WS-C
   DISPLAY "LARGEST NUMBER IS:" WS-B
   ELSE
   DISPLAY "LARGEST NUMBER IS:" WS-C
  END-IF
 END-IF
STOP RUN.
