IDENTIFICATION DIVISION.
PROGRAM-ID. PALINDROME.

DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-NUM PIC 9(5).
  01 WS-TEMP PIC 9(5).
  01 WS-REV PIC 9(5) VALUE 0.
  01 WS-REM PIC 9.
 
PROCEDURE DIVISION.
 ACCEPT WS-NUM
 DISPLAY "ENTER A NUMBER : " WS-NUM
  MOVE WS-NUM TO WS-TEMP
 PERFORM UNTIL WS-TEMP = 0
  DIVIDE WS-TEMP BY 10 GIVING WS-TEMP REMAINDER WS-REM
   COMPUTE WS-REV = (WS-REV * 10) + WS-REM
 END-PERFORM
 IF WS-NUM = WS-REV
  DISPLAY "NUMBER IS A PALINDROME"
 ELSE
  DISPLAY "NUMBER IS NOT A PALINDROME"
 END-IF
STOP RUN.
