IDENTIFICATION DIVISION.
PROGRAM-ID. PRIME-NUMBER.
DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-NUM PIC 9(3).
  01 WS-DIV PIC 9(3).
  01 WS-REM PIC 9(3).
  01 WS-QUO PIC 9(3).
  01 WS-PRIME PIC X.
PROCEDURE DIVISION.
  DISPLAY "PRIME NUMBERS FROM 1 TO 200"
  PERFORM VARYING WS-NUM FROM 2 BY 1 UNTIL WS-NUM > 200
   MOVE 'Y' TO WS-PRIME
  PERFORM VARYING WS-DIV FROM 2 BY 1 UNTIL WS-DIV >= WS-NUM
  DIVIDE WS-NUM BY WS-DIV GIVING WS-QUO REMAINDER WS-REM
  IF WS-REM = 0
   MOVE 'N' TO WS-PRIME
  EXIT PERFORM
  END-IF
  END-PERFORM
   IF WS-PRIME = 'Y'
    DISPLAY WS-NUM
   END-IF
  END-PERFORM
STOP RUN.
