IDENTIFICATION DIVISION.
PROGRAM-ID. PRINT100.

DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-NUMBER PIC 9(3) VALUE 1.

PROCEDURE DIVISION.
 PERFORM PRINT-NUMBERS UNTIL WS-NUMBER > 100
 STOP RUN.
PRINT-NUMBERS.
 DISPLAY WS-NUMBER
 ADD 1 TO WS-NUMBER.