IDENTIFICATION DIVISION.
PROGRAM-ID. REVERSE-NUMBER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUMBER   PIC 9(5).
01 WS-REV      PIC 9(5) VALUE 0.
01 WS-REM      PIC 9.
PROCEDURE DIVISION.
DISPLAY "ENTER THE NUMBER:".
ACCEPT WS-NUMBER.
PERFORM 5 TIMES
 DIVIDE WS-NUMBER BY 10
 GIVING WS-NUMBER
 REMAINDER WS-REM
 COMPUTE WS-REV=(WS-REV * 10) + WS-REM
END-PERFORM.
DISPLAY "REVERSED NUMBER : " WS-REV
STOP RUN.
