IDENTIFICATION DIVISION.
  PROGRAM-ID. SIMPLE-INTREST.

DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 WS-PRINCIPAL PIC 9(7).
   01 WS-RATE      PIC 9(3).
   01 WS-TIME      PIC 9(3).
   01 WS-SI        PIC 9(9)V99.

PROCEDURE DIVISION.
  ACCEPT WS-PRINCIPAL.
   ACCEPT WS-RATE.
   ACCEPT WS-TIME.
 DISPLAY "ENTER PRINCIPAL AMOUNT : " WS-PRINCIPAL.
 DISPLAY "ENTER RATE OF INTEREST : "WS-RATE.
 DISPLAY "ENTER TIME (IN YEARS) : "WS-TIME.
   
 COMPUTE WS-SI = (WS-PRINCIPAL * WS-RATE * WS-TIME) / 100.
   DISPLAY "SIMPLE INTEREST IS : " WS-SI.
STOP RUN.
