IDENTIFICATION DIVISION.
 PROGRAM-ID. SUM20.

DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 WS-NUMBERS.
   05 WS-NUM PIC 9(3) OCCURS 20 TIMES.
  01 WS-I   PIC 9(2).
  01 WS-SUM PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
 DISPLAY "ENTER 20 NUMBERS"
  PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 20
   ACCEPT WS-NUM(WS-I)
 END-PERFORM
 PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 20
   ADD WS-NUM(WS-I) TO WS-SUM
 END-PERFORM
 DISPLAY "SUM OF 20 NUMBERS IS : " WS-SUM
STOP RUN.
